src/geekbang-ai-internal-reference.org
#+title: 极客时间|AI技术内参 文章目录
#+options: num:nil


** [[https://time.geekbang.org/column/article/153][开篇词 | 你的360度人工智能信息助理]]

“AI技术内参”只是一个起点，希望你能够从这个专栏出发，在人工智能这个领域前行得更好、更高、更远。


** [[https://time.geekbang.org/column/article/156][001 | 如何组建一个数据科学团队？]]

今天我就来和你聊一聊作为一个工程团队的负责人，或者一家公司的CEO，该如何招聘并打造自己的数据科学团队。


** [[https://time.geekbang.org/column/article/159][002 | 聊聊2017年KDD大会的时间检验奖]]

2017年的SIGKDD时间检验奖授予了美国康奈尔大学信息科学系主任、计算机科学系教授索斯藤·乔基姆斯。


** [[https://time.geekbang.org/column/article/308][003 | 数据科学家基础能力之概率统计]]

概率统计知识和数据科学家的日常工作，以及一个人工智能项目的正常运作都密切相关，概率统计知识正在人工智能中...


** [[https://time.geekbang.org/column/article/311][004 | 数据科学家基础能力之机器学习]]

机器学习主要解决的是两类问题：监督学习和无监督学习。掌握机器学习，主要就是学习这两类问题，掌握解决这两类...


** [[https://time.geekbang.org/column/article/316][005 | 数据科学家基础能力之系统]]

对于初学人工智能的工程师或者数据科学家来说，在知识积累的过程中，“系统”往往是一个很容易被忽视的环节。


** [[https://time.geekbang.org/column/article/370][006 | Google的点击率系统模型]]

点击率预估系统是整个广告系统的核心功能之一，分享一篇难得一见的工业界级别的科技论文，来自Google广告团队。


** [[https://time.geekbang.org/column/article/376][007 | LDA模型的前世今生]]

今天我要介绍的是一个叫做LDA的模型，它在过去十年里开启了一个领域叫主题模型。一段时间内，LDA是分析文本信息...


** [[https://time.geekbang.org/column/article/379][008 | 曾经辉煌的雅虎研究院]]

雅虎研究院曾构建了一支世界级的研发团队，发表了一系列有价值的研究成果，但未能摆脱最后衰落的结局，一切辉煌...


** [[https://time.geekbang.org/column/article/382][009 | 数据科学家高阶能力之分析产品]]

站在人工智能工程师和数据科学家的角度，我们如何理解并提升分析产品的能力，学会了解产品的需求。


** [[https://time.geekbang.org/column/article/385][010 | 数据科学家高阶能力之评估产品]]

对于人工智能工程师和数据科学家的工作来说，不管是模型和算法，还是产品迭代，都离不开“指标”和“评估”这两...


