html/geekbang-ai-internal-reference.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>极客时间|AI技术内参 文章目录</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">极客时间|AI技术内参 文章目录</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf6d94f1">开篇词 | 你的360度人工智能信息助理</a></li>
<li><a href="#org47486d9">001 | 如何组建一个数据科学团队？</a></li>
<li><a href="#org2e92fc5">002 | 聊聊2017年KDD大会的时间检验奖</a></li>
<li><a href="#orga7499f8">003 | 数据科学家基础能力之概率统计</a></li>
<li><a href="#org06e91b3">004 | 数据科学家基础能力之机器学习</a></li>
<li><a href="#orgde0c84a">005 | 数据科学家基础能力之系统</a></li>
<li><a href="#orgdbe0ef1">006 | Google的点击率系统模型</a></li>
<li><a href="#org692151a">007 | LDA模型的前世今生</a></li>
<li><a href="#org7856470">008 | 曾经辉煌的雅虎研究院</a></li>
<li><a href="#org046b940">009 | 数据科学家高阶能力之分析产品</a></li>
<li><a href="#org3d2f616">010 | 数据科学家高阶能力之评估产品</a></li>
<li><a href="#org15405fa">011 | 数据科学家高阶能力之如何系统提升产品性能</a></li>
<li><a href="#org36d2aab">012 | 精读2017年KDD最佳研究论文</a></li>
<li><a href="#org8ecf64c">013 | 精读2017年KDD最佳应用数据科学论文</a></li>
<li><a href="#org582c15a">014 | 精读AlphaGo Zero论文</a></li>
<li><a href="#orgf0d341f">015 | 精读2017年EMNLP最佳长论文之一</a></li>
<li><a href="#org7edd5a7">016 | 精读2017年EMNLP最佳长论文之二</a></li>
<li><a href="#orga82c7c4">017 | 精读2017年EMNLP最佳短论文</a></li>
<li><a href="#orgd1973f9">018 | 经典搜索核心算法：TF-IDF及其变种</a></li>
<li><a href="#org751e839">019 | 经典搜索核心算法：BM25及其变种（内附全年目录）</a></li>
<li><a href="#orgf29985d">020 | 经典搜索核心算法：语言模型及其变种</a></li>
<li><a href="#org803d9db">021 | 机器学习排序算法：单点法排序学习</a></li>
<li><a href="#org30f5591">022 | 机器学习排序算法：配对法排序学习</a></li>
<li><a href="#org121d7dc">023 | 机器学习排序算法：列表法排序学习</a></li>
<li><a href="#orge66ebde">024 | “查询关键字理解”三部曲之分类</a></li>
<li><a href="#orga07e69b">025 | “查询关键字理解”三部曲之解析</a></li>
<li><a href="#orge769f13">026 | “查询关键字理解”三部曲之扩展</a></li>
<li><a href="#org91091a5">027 | 搜索系统评测，有哪些基础指标？</a></li>
<li><a href="#org8671dc3">028 | 搜索系统评测，有哪些高级指标？</a></li>
<li><a href="#org7f9eab4">029 | 如何评测搜索系统的在线表现？</a></li>
<li><a href="#org46adf67">030 | 文档理解第一步：文档分类</a></li>
<li><a href="#orgc0f0640">031 | 文档理解的关键步骤：文档聚类</a></li>
<li><a href="#org8aadbef">032 | 文档理解的重要特例：多模文档建模</a></li>
<li><a href="#orgc185071">033 | 大型搜索框架宏观视角：发展、特点及趋势</a></li>
<li><a href="#org96b07e0">034 | 多轮打分系统概述</a></li>
<li><a href="#orge66d5d6">035 | 搜索索引及其相关技术概述</a></li>
<li><a href="#orgdd9687f">036 | PageRank算法的核心思想是什么？</a></li>
<li><a href="#orga7c690d">037 | 经典图算法之HITS</a></li>
<li><a href="#org0280877">038 | 社区检测算法之“模块最大化 ”</a></li>
<li><a href="#org1fa99d8">039 | 机器学习排序算法经典模型：RankSVM</a></li>
<li><a href="#org453f87c">040 | 机器学习排序算法经典模型：GBDT</a></li>
<li><a href="#orgb21c528">041 | 机器学习排序算法经典模型：LambdaMART</a></li>
<li><a href="#orgdf3e269">042 | 基于深度学习的搜索算法：深度结构化语义模型</a></li>
<li><a href="#orgbfb4f97">043 | 基于深度学习的搜索算法：卷积结构下的隐含语义模型</a></li>
<li><a href="#org7ecb459">044 | 基于深度学习的搜索算法：局部和分布表征下的搜索模型</a></li>
<li><a href="#org7561f30">045 | 职场话题：当数据科学家遇见产品团队</a></li>
<li><a href="#orgb0a640a">046 | 职场话题：数据科学家应聘要具备哪些能力？</a></li>
<li><a href="#org6cab500">047 | 职场话题：聊聊数据科学家的职场规划</a></li>
<li><a href="#org5bea0d7">048 | 精读2017年ICCV最佳研究论文</a></li>
<li><a href="#org17124d5">049 | 精读2017年ICCV最佳学生论文</a></li>
<li><a href="#orgb2917d6">050 | 如何将“深度强化学习”应用到视觉问答系统？</a></li>
<li><a href="#org53f1cd3">内参特刊 | 和你聊聊每个人都关心的人工智能热点话题</a></li>
<li><a href="#org3a25603">051 | 精读2017年NIPS最佳研究论文之一：如何解决非凸优化问题？</a></li>
<li><a href="#org2db923c">052 | 精读2017年NIPS最佳研究论文之二：KSD测试如何检验两个分布的异同？</a></li>
<li><a href="#org89e061c">053 | 精读2017年NIPS最佳研究论文之三：如何解决非完美信息博弈问题？</a></li>
<li><a href="#org758851a">054 | 数据科学团队养成：电话面试指南</a></li>
<li><a href="#org2440651">055 | 数据科学团队养成：Onsite面试面面观</a></li>
<li><a href="#org61e2a83">056 | 成为“香饽饽”的数据科学家，如何衡量他们的工作呢？</a></li>
<li><a href="#org5d98c24">057 | 人工智能领域知识体系更新周期只有5～6年，数据科学家如何培养？</a></li>
<li><a href="#org7c4df47">058 | 数据科学家团队组织架构：水平还是垂直，这是个问题</a></li>
<li><a href="#org5c0347d">059 | 2017人工智能技术发展盘点</a></li>
<li><a href="#org54db77c">060 | WSDM 2018论文精读：看谷歌团队如何做位置偏差估计</a></li>
<li><a href="#org56b2767">061 | WSDM 2018论文精读：看京东团队如何挖掘商品的替代信息和互补信息</a></li>
<li><a href="#org72abcf9">062 | WSDM 2018论文精读：深度学习模型中如何使用上下文信息？</a></li>
<li><a href="#orgdf9a8ee">复盘 1 | 搜索核心技术模块</a></li>
<li><a href="#orgbaae8db">063 | 简单推荐模型之一：基于流行度的推荐模型</a></li>
<li><a href="#orgd33a278">064 | 简单推荐模型之二：基于相似信息的推荐模型</a></li>
<li><a href="#orgd706a3d">065 | 简单推荐模型之三：基于内容信息的推荐模型</a></li>
<li><a href="#orgd03cd14">066 | 基于隐变量的模型之一：矩阵分解</a></li>
<li><a href="#org0870644">067 | 基于隐变量的模型之二：基于回归的矩阵分解</a></li>
<li><a href="#org152b79b">068 | 基于隐变量的模型之三：分解机</a></li>
<li><a href="#org06c08d7">069 | 高级推荐模型之一：张量分解模型</a></li>
<li><a href="#org2115b37">070 | 高级推荐模型之二：协同矩阵分解</a></li>
<li><a href="#org3ebda94">071 | 高级推荐模型之三：优化复杂目标函数</a></li>
<li><a href="#org5571b66">072 | 推荐的Exploit和Explore算法之一：EE算法综述</a></li>
<li><a href="#org5c29551">073 | 推荐的Exploit和Explore算法之二：UCB算法</a></li>
<li><a href="#org52a447f">074 | 推荐的Exploit和Explore算法之三：汤普森采样算法</a></li>
<li><a href="#org5d35dbe">075 | 推荐系统评测之一：传统线下评测</a></li>
<li><a href="#org39306a8">076 | 推荐系统评测之二：线上评测</a></li>
<li><a href="#org96aa9a6">077 | 推荐系统评测之三：无偏差估计</a></li>
<li><a href="#orgaf1c714">078 | 现代推荐架构剖析之一：基于线下离线计算的推荐架构</a></li>
<li><a href="#org3176c9f">079 | 现代推荐架构剖析之二：基于多层搜索架构的推荐系统</a></li>
<li><a href="#org72ad1a1">080 | 现代推荐架构剖析之三：复杂现代推荐架构漫谈</a></li>
<li><a href="#org3f97727">081 | 基于深度学习的推荐模型之一：受限波兹曼机</a></li>
<li><a href="#orgb017997">082 | 基于深度学习的推荐模型之二：基于RNN的推荐系统</a></li>
<li><a href="#orgaa24b8c">083 | 基于深度学习的推荐模型之三：利用深度学习来扩展推荐系统</a></li>
<li><a href="#org9b660d3">复盘 2 | 推荐系统核心技术模块</a></li>
<li><a href="#orgb383df5">084 | LDA变种模型知多少</a></li>
<li><a href="#orgfa8109c">085 | 针对大规模数据，如何优化LDA算法？</a></li>
<li><a href="#orgbfa0ef4">086 | 基础文本分析模型之一：隐语义分析</a></li>
<li><a href="#org2dd2745">087 | 基础文本分析模型之二：概率隐语义分析</a></li>
<li><a href="#orga424fee">088 | 基础文本分析模型之三：EM算法</a></li>
<li><a href="#orgcf2b8ba">089 | 为什么需要Word2Vec算法？</a></li>
<li><a href="#org8f6882d">090 | Word2Vec算法有哪些扩展模型？</a></li>
<li><a href="#org64a8c72">091 | Word2Vec算法有哪些应用？</a></li>
<li><a href="#org1852c86">092 | 序列建模的深度学习利器：RNN基础架构</a></li>
<li><a href="#orgd9e34d0">093 | 基于门机制的RNN架构：LSTM与GRU</a></li>
<li><a href="#org031bc1f">094 | RNN在自然语言处理中有哪些应用场景？</a></li>
<li><a href="#org2653faa">095 | 对话系统之经典的对话模型</a></li>
<li><a href="#orgbdc732e">096 | 任务型对话系统有哪些技术要点？</a></li>
<li><a href="#org7630415">097 | 聊天机器人有哪些核心技术要点？</a></li>
<li><a href="#org17a0c1f">098 | 什么是文档情感分类？</a></li>
<li><a href="#org94584dc">099 | 如何来提取情感“实体”和“方面”呢？</a></li>
<li><a href="#org8fb95ca">100 | 文本情感分析中如何做意见总结和搜索？</a></li>
<li><a href="#org893b498">101 | The Web 2018论文精读：如何对商品的图片美感进行建模？</a></li>
<li><a href="#org462bf65">102 | The Web 2018论文精读：如何改进经典的推荐算法BPR？</a></li>
<li><a href="#orga3d1c34">103 | The Web 2018论文精读：如何从文本中提取高元关系？</a></li>
<li><a href="#org97b0b28">104 | 如何快速学习国际顶级学术会议的内容？</a></li>
<li><a href="#org5ed7875">复盘 3 | 自然语言处理及文本处理核心技术模块</a></li>
<li><a href="#org1c0ff00">105 | 广告系统概述</a></li>
<li><a href="#org623ec7e">106 | 广告系统架构</a></li>
<li><a href="#orga69f365">107 | 广告回馈预估综述</a></li>
<li><a href="#org2cdf590">108 | Facebook的广告点击率预估模型</a></li>
<li><a href="#orgaed7e26">109 | 雅虎的广告点击率预估模型</a></li>
<li><a href="#orgcf3e86f">110 | LinkedIn的广告点击率预估模型</a></li>
<li><a href="#orgfbd0e4d">111 | Twitter的广告点击率预估模型</a></li>
<li><a href="#orgd63dc5b">112 | 阿里巴巴的广告点击率预估模型</a></li>
<li><a href="#org11cc097">113 | 什么是“基于第二价位的广告竞拍”？</a></li>
<li><a href="#orge63f5c8">114 | 广告的竞价策略是怎样的？</a></li>
<li><a href="#org0107e04">115 | 如何优化广告的竞价策略？</a></li>
<li><a href="#org85e5bb4">116 | 如何控制广告预算？</a></li>
<li><a href="#org4cd7484">117 | 如何设置广告竞价的底价？</a></li>
<li><a href="#org51632a1">118 | 聊一聊“程序化直接购买”和“广告期货”</a></li>
<li><a href="#org92266a7">119 | 归因模型：如何来衡量广告的有效性</a></li>
<li><a href="#orgaccaf45">120 | 广告投放如何选择受众？如何扩展受众群？</a></li>
<li><a href="#org169e6bc">121 | 如何利用机器学习技术来检测广告欺诈？</a></li>
<li><a href="#org96eb82f">122 | 数据科学家必备套路之一：搜索套路</a></li>
<li><a href="#org0fa5d40">123 | 数据科学家必备套路之二：推荐套路</a></li>
<li><a href="#org54a5c6b">124 | 数据科学家必备套路之三：广告套路</a></li>
<li><a href="#orgbcf6ca5">125 | SIGIR 2018论文精读：偏差和“流行度”之间的关系</a></li>
<li><a href="#org2f42a12">126 | SIGIR 2018论文精读：如何利用对抗学习来增强排序模型的普适性？</a></li>
<li><a href="#org3f8985e">127 | SIGIR 2018论文精读：如何对搜索页面上的点击行为进行序列建模？</a></li>
<li><a href="#orgabbbc2a">128 | CVPR 2018论文精读：如何研究计算机视觉任务之间的关系？</a></li>
<li><a href="#org0912339">129 | CVPR 2018论文精读：如何从整体上对人体进行三维建模？</a></li>
<li><a href="#orgb08b506">130 | CVPR 2018论文精读：如何解决排序学习计算复杂度高这个问题？</a></li>
<li><a href="#org3475de2">131 | ICML 2018论文精读：模型经得起对抗样本的攻击？这或许只是个错觉</a></li>
<li><a href="#org512e7eb">132 | ICML 2018论文精读：聊一聊机器学习算法的“公平性”问题</a></li>
<li><a href="#orge8ab2c9">133 | ICML 2018论文精读：优化目标函数的时候，有可能放大了“不公平”？</a></li>
<li><a href="#org7743ffe">134 | ACL 2018论文精读：问答系统场景下，如何提出好问题？</a></li>
<li><a href="#org0521ff5">135 | ACL 2018论文精读：什么是对话中的前提触发？如何检测？</a></li>
<li><a href="#org10f0405">136 | ACL 2018论文精读：什么是“端到端”的语义哈希？</a></li>
<li><a href="#org7ab8fa2">137 | 如何做好人工智能项目的管理？</a></li>
<li><a href="#org963af09">138 | 数据科学团队必备的工程流程三部曲</a></li>
<li><a href="#orge9b80ea">139 | 数据科学团队怎么选择产品和项目？</a></li>
<li><a href="#orgaa9eb04">140 | 什么是计算机视觉？</a></li>
<li><a href="#org7a11967">141 | 掌握计算机视觉任务的基础模型和操作</a></li>
<li><a href="#org6be5548">142 | 计算机视觉中的特征提取难在哪里？</a></li>
<li><a href="#org8b7d378">143 | 基于深度学习的计算机视觉技术（一）：深度神经网络入门</a></li>
<li><a href="#orgc172a58">144 | 基于深度学习的计算机视觉技术（二）：基本的深度学习模型</a></li>
<li><a href="#orgcb0d8cc">145 | 基于深度学习的计算机视觉技术（三）：深度学习模型的优化</a></li>
<li><a href="#orgb8525eb">146 | 计算机视觉领域的深度学习模型（一）：AlexNet</a></li>
<li><a href="#orge4622b9">147 | 计算机视觉领域的深度学习模型（二）：VGG &amp; GoogleNet</a></li>
<li><a href="#orgae86f8d">148 | 计算机视觉领域的深度学习模型（三）：ResNet</a></li>
<li><a href="#orgbad9635">149 | 计算机视觉高级话题（一）：图像物体识别和分割</a></li>
<li><a href="#orge5cedf1">150 | 计算机视觉高级话题（二）：视觉问答</a></li>
<li><a href="#org88c5cb5">151 | 计算机视觉高级话题（三）：产生式模型</a></li>
<li><a href="#orgd7391dd">152 | 在人工智能领域，如何快速找到学习的切入点？</a></li>
<li><a href="#org32dc77f">153 | 人工智能技术选择，该从哪里获得灵感？</a></li>
<li><a href="#org06f18ee">154 | 近在咫尺，走进人工智能研究</a></li>
<li><a href="#orgf88f156">155 | 微软研究院：工业界研究机构的楷模</a></li>
<li><a href="#org4ba31ae">156 | 聊一聊谷歌特立独行的混合型研究</a></li>
<li><a href="#org7c35c60">复盘 4 | 广告系统核心技术模块</a></li>
<li><a href="#org303df25">复盘 5 | 计算机视觉核心技术模块</a></li>
<li><a href="#org2f81b1d">复盘 6 | 数据科学家与数据科学团队是怎么养成的？</a></li>
<li><a href="#orgddbadbe">复盘 7 | 一起来读人工智能国际顶级会议论文</a></li>
<li><a href="#org033bfd6">结束语 | 雄关漫道真如铁，而今迈步从头越</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgf6d94f1" class="outline-2">
<h2 id="orgf6d94f1"><a href="https://time.geekbang.org/column/article/153">开篇词 | 你的360度人工智能信息助理</a></h2>
<div class="outline-text-2" id="text-orgf6d94f1">
<p>
“AI技术内参”只是一个起点，希望你能够从这个专栏出发，在人工智能这个领域前行得更好、更高、更远。
</p>
</div>
</div>


<div id="outline-container-org47486d9" class="outline-2">
<h2 id="org47486d9"><a href="https://time.geekbang.org/column/article/156">001 | 如何组建一个数据科学团队？</a></h2>
<div class="outline-text-2" id="text-org47486d9">
<p>
今天我就来和你聊一聊作为一个工程团队的负责人，或者一家公司的CEO，该如何招聘并打造自己的数据科学团队。
</p>
</div>
</div>


<div id="outline-container-org2e92fc5" class="outline-2">
<h2 id="org2e92fc5"><a href="https://time.geekbang.org/column/article/159">002 | 聊聊2017年KDD大会的时间检验奖</a></h2>
<div class="outline-text-2" id="text-org2e92fc5">
<p>
2017年的SIGKDD时间检验奖授予了美国康奈尔大学信息科学系主任、计算机科学系教授索斯藤·乔基姆斯。
</p>
</div>
</div>


<div id="outline-container-orga7499f8" class="outline-2">
<h2 id="orga7499f8"><a href="https://time.geekbang.org/column/article/308">003 | 数据科学家基础能力之概率统计</a></h2>
<div class="outline-text-2" id="text-orga7499f8">
<p>
概率统计知识和数据科学家的日常工作，以及一个人工智能项目的正常运作都密切相关，概率统计知识正在人工智能中&#x2026;
</p>
</div>
</div>


<div id="outline-container-org06e91b3" class="outline-2">
<h2 id="org06e91b3"><a href="https://time.geekbang.org/column/article/311">004 | 数据科学家基础能力之机器学习</a></h2>
<div class="outline-text-2" id="text-org06e91b3">
<p>
机器学习主要解决的是两类问题：监督学习和无监督学习。掌握机器学习，主要就是学习这两类问题，掌握解决这两类&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgde0c84a" class="outline-2">
<h2 id="orgde0c84a"><a href="https://time.geekbang.org/column/article/316">005 | 数据科学家基础能力之系统</a></h2>
<div class="outline-text-2" id="text-orgde0c84a">
<p>
对于初学人工智能的工程师或者数据科学家来说，在知识积累的过程中，“系统”往往是一个很容易被忽视的环节。
</p>
</div>
</div>


<div id="outline-container-orgdbe0ef1" class="outline-2">
<h2 id="orgdbe0ef1"><a href="https://time.geekbang.org/column/article/370">006 | Google的点击率系统模型</a></h2>
<div class="outline-text-2" id="text-orgdbe0ef1">
<p>
点击率预估系统是整个广告系统的核心功能之一，分享一篇难得一见的工业界级别的科技论文，来自Google广告团队。
</p>
</div>
</div>


<div id="outline-container-org692151a" class="outline-2">
<h2 id="org692151a"><a href="https://time.geekbang.org/column/article/376">007 | LDA模型的前世今生</a></h2>
<div class="outline-text-2" id="text-org692151a">
<p>
今天我要介绍的是一个叫做LDA的模型，它在过去十年里开启了一个领域叫主题模型。一段时间内，LDA是分析文本信息&#x2026;
</p>
</div>
</div>


<div id="outline-container-org7856470" class="outline-2">
<h2 id="org7856470"><a href="https://time.geekbang.org/column/article/379">008 | 曾经辉煌的雅虎研究院</a></h2>
<div class="outline-text-2" id="text-org7856470">
<p>
雅虎研究院曾构建了一支世界级的研发团队，发表了一系列有价值的研究成果，但未能摆脱最后衰落的结局，一切辉煌&#x2026;
</p>
</div>
</div>


<div id="outline-container-org046b940" class="outline-2">
<h2 id="org046b940"><a href="https://time.geekbang.org/column/article/382">009 | 数据科学家高阶能力之分析产品</a></h2>
<div class="outline-text-2" id="text-org046b940">
<p>
站在人工智能工程师和数据科学家的角度，我们如何理解并提升分析产品的能力，学会了解产品的需求。
</p>
</div>
</div>


<div id="outline-container-org3d2f616" class="outline-2">
<h2 id="org3d2f616"><a href="https://time.geekbang.org/column/article/385">010 | 数据科学家高阶能力之评估产品</a></h2>
<div class="outline-text-2" id="text-org3d2f616">
<p>
对于人工智能工程师和数据科学家的工作来说，不管是模型和算法，还是产品迭代，都离不开“指标”和“评估”这两&#x2026;
</p>
</div>
</div>
