src/geekbang-ai-internal-reference.org
** [[https://time.geekbang.org/column/article/388][011 | 数据科学家高阶能力之如何系统提升产品性能]]

人工智能工程师和数据科学家的一个核心任务，就是依靠人工智能、机器学习这样的工具来帮助产品不断提升品质，吸...


** [[https://time.geekbang.org/column/article/391][012 | 精读2017年KDD最佳研究论文]]

KDD历年的最佳研究论文，都会对之后很多领域的研究有开创性的影响。从阅读经典文献和学习最新研究成果的角度，...


** [[https://time.geekbang.org/column/article/394][013 | 精读2017年KDD最佳应用数据科学论文]]

2017年KDD最佳应用数据科学论文介绍了如何智能地分析安卓恶意软件，提出了一种新的基于结构性异构信息网络的方...


** [[https://time.geekbang.org/column/article/654][014 | 精读AlphaGo Zero论文]]

谷歌DeepMind团队在《自然》杂志上发表了AlphaGo的最新研究成果，AlphaGo Zero，该论文值得精读。


** [[https://time.geekbang.org/column/article/397][015 | 精读2017年EMNLP最佳长论文之一]]

机器学习的研究人员近期发现，数据中可能蕴含着一些社会赋予的偏见，而机器学习算法很有可能会放大这些偏见。这...


** [[https://time.geekbang.org/column/article/658][016 | 精读2017年EMNLP最佳长论文之二]]

如何利用自然语言处理技术来解决一个社会问题，比如在线论坛中的抑郁与自残行为风险评估，正逐渐成为很多社会科...


** [[https://time.geekbang.org/column/article/661][017 | 精读2017年EMNLP最佳短论文]]

多个机器人在对话中产生“非自然”的对话，这是如何产生的，有没有什么方式避免这样的结果？


** [[https://time.geekbang.org/column/article/822][018 | 经典搜索核心算法：TF-IDF及其变种]]

在信息检索、文本挖掘以及自然语言处理领域，TF-IDF作为一个最基础的方法，依然发挥着不可替代的作用。


** [[https://time.geekbang.org/column/article/828][019 | 经典搜索核心算法：BM25及其变种（内附全年目录）]]

BM25是“非监督学习”排序算法中的一个典型代表，在很多信息检索的任务中表现优异，是很多工程师首选的算法之一...


** [[https://time.geekbang.org/column/article/830][020 | 经典搜索核心算法：语言模型及其变种]]

“语言模型”的核心思想是利用概率模型来描述查询关键字和目标文档之间的关系，相对于TF-IDF算法和BM25算法而...


** [[https://time.geekbang.org/column/article/949][021 | 机器学习排序算法：单点法排序学习]]

单点法排序学习是一类最简单也最实用的机器学习排序算法，在工业界得到广泛应用且效果显著。


** [[https://time.geekbang.org/column/article/950][022 | 机器学习排序算法：配对法排序学习]]

配对法排序学习由单点法引申而来，其基本思路是对样本进行两两比较，从比较中学习排序，离真正目标又近了一步。


** [[https://time.geekbang.org/column/article/952][023 | 机器学习排序算法：列表法排序学习]]

列表法排序学习的基本思路是尝试直接优化像NDCG这样的指标，从而能够学习到最佳排序结果。


** [[https://time.geekbang.org/column/article/1077][024 | “查询关键字理解”三部曲之分类]]

查询关键字理解最基本的一个步骤就是给查询关键字分类。查询关键字从大类上分为信息意图、交易意图以及导航意图...


** [[https://time.geekbang.org/column/article/1079][025 | “查询关键字理解”三部曲之解析]]

查询关键字解析是对查询关键字的微观分析，今天将重点介绍查询关键字分割和查询关键字标注两个模块。


** [[https://time.geekbang.org/column/article/1081][026 | “查询关键字理解”三部曲之扩展]]

查询关键字扩展的主要目的是希望能够补充用户输入的信息，从而达到丰富查询结果的效果，让用户有更好的体验。


** [[https://time.geekbang.org/column/article/1296][027 | 搜索系统评测，有哪些基础指标？]]

现代搜索技术中，如何评价我们构建的系统？首先要掌握这些基础方法，全面了解线下评测的特点和局限，熟悉“二元...


** [[https://time.geekbang.org/column/article/1299][028 | 搜索系统评测，有哪些高级指标？]]

今天重点介绍基于“多程度相关”评价体系的由来和DCG、nDCG的概念，以及如何来比较两个排序的好坏。


** [[https://time.geekbang.org/column/article/1300][029 | 如何评测搜索系统的在线表现？]]

如何能够有效地进行在线实验，包括实验设计、实验评测等，都是非常前沿的研究课题，在线评测的很多话题值得深入...


** [[https://time.geekbang.org/column/article/1448][030 | 文档理解第一步：文档分类]]

文档理解最基本的一个步骤就是给文档分类，今天我就来和你聊一聊文档分类的一些基本概念和技术，让你对这方面的...


** [[https://time.geekbang.org/column/article/1449][031 | 文档理解的关键步骤：文档聚类]]

我们可以把文档聚类看作非监督学习的典型代表。今天就和你聊聊文档聚类的类型、应用场景、基本模型以及所面临的...


** [[https://time.geekbang.org/column/article/1450][032 | 文档理解的重要特例：多模文档建模]]

文档理解中的多模数据建模问题，是一个非常火热的领域，如何理解多媒体数据是现代数据处理的一个重要问题 。


** [[https://time.geekbang.org/column/article/1702][033 | 大型搜索框架宏观视角：发展、特点及趋势]]

有了对搜索系统各个基本组成部分的把握，今天我们就第一次从整体上来看看大型搜索系统框架的演变和历史发展。


** [[https://time.geekbang.org/column/article/1762][034 | 多轮打分系统概述]]

什么是多轮打分系统？为什么搜索系统需要多轮打分？今天我们就来剖析一下搜索系统的这个重要思路：多轮打分系统...


** [[https://time.geekbang.org/column/article/1821][035 | 搜索索引及其相关技术概述]]

索引系统的基本组成和原理是怎样的？索引相关的技术有哪些？查询关键字处理有什么策略？今天我们就来谈谈索引及...


** [[https://time.geekbang.org/column/article/1883][036 | PageRank算法的核心思想是什么？]]

今天我们一起讨论用图来表达网页与网页之间的关系，并且计算网页重要性的经典算法：PageRank。


** [[https://time.geekbang.org/column/article/1938][037 | 经典图算法之HITS]]

HITS是经典的图算法中很重要的一种。HITS的基本原理是什么？有哪些特点？如何把HITS算法用于搜索中呢？


** [[https://time.geekbang.org/column/article/1940][038 | 社区检测算法之“模块最大化 ”]]

今天我们来看一类完全不一样的网页分析工具，这类分析有时候被称作“社区检测”，我们就重点来分析一下“模块最...


** [[https://time.geekbang.org/column/article/2026][039 | 机器学习排序算法经典模型：RankSVM]]

今天和你分享配对法排序中最有价值一个算法，RankSVM，也就是排序支持向量机。这个算法的核心思想是应用支持向...


** [[https://time.geekbang.org/column/article/2052][040 | 机器学习排序算法经典模型：GBDT]]

梯度增强决策树作为一种普适的机器学习排序算法得到广泛应用。今天我们来聊聊这一算法的核心思路与应用。


** [[https://time.geekbang.org/column/article/2099][041 | 机器学习排序算法经典模型：LambdaMART]]

今天我们来分享本周的最后一个经典模型：LambdaMART。这是微软在Bing中使用了较长时间的模型，也在机器学习排序...


** [[https://time.geekbang.org/column/article/2297][042 | 基于深度学习的搜索算法：深度结构化语义模型]]

本周我们来看一些关于搜索算法的前沿思考，特别是将深度学习技术应用到改进搜索算法中的各种尝试。


** [[https://time.geekbang.org/column/article/2298][043 | 基于深度学习的搜索算法：卷积结构下的隐含语义模型]]

今天分享的论文是周一内容的一个后续工作，主要探讨了深度学习中的卷积神经网络能否应用在搜索中，并取得较好的...


** [[https://time.geekbang.org/column/article/2332][044 | 基于深度学习的搜索算法：局部和分布表征下的搜索模型]]

今天我们一起来看搜索专题的最后一篇内容，一个结合了学习完全匹配的局部表征和模糊匹配的分布表征的搜索模型。


** [[https://time.geekbang.org/column/article/2504][045 | 职场话题：当数据科学家遇见产品团队]]

数据科学家和人工智能工程师会遇到什么样的职场发展和协作问题？今天我们就聊一聊数据科学家和产品团队的关系这...


** [[https://time.geekbang.org/column/article/2565][046 | 职场话题：数据科学家应聘要具备哪些能力？]]

今天我们继续讨论数据科学家的职场话题。在面试一家公司时，究竟应该怎么准备？有哪些信息是需要了解的？


