html/geekbang-ai-internal-reference.html


<div id="outline-container-org6cab500" class="outline-2">
<h2 id="org6cab500"><a href="https://time.geekbang.org/column/article/2625">047 | 职场话题：聊聊数据科学家的职场规划</a></h2>
<div class="outline-text-2" id="text-org6cab500">
<p>
我们今天要探讨的不是数据科学家“应该”怎么发展，而是说，有哪些职业发展的“可能性”，希望能够为你规划自己&#x2026;
</p>
</div>
</div>


<div id="outline-container-org5bea0d7" class="outline-2">
<h2 id="org5bea0d7"><a href="https://time.geekbang.org/column/article/2681">048 | 精读2017年ICCV最佳研究论文</a></h2>
<div class="outline-text-2" id="text-org5bea0d7">
<p>
今天我们来剖析ICCV 2017年的最佳研究论文“Mask R-CNN”，这篇论文是一个集大成的工作。
</p>
</div>
</div>


<div id="outline-container-org17124d5" class="outline-2">
<h2 id="org17124d5"><a href="https://time.geekbang.org/column/article/2717">049 | 精读2017年ICCV最佳学生论文</a></h2>
<div class="outline-text-2" id="text-org17124d5">
<p>
今天我们来分享2017年ICCV的最佳学生论文，这篇文章解决的问题也是物体识别和语义分割。
</p>
</div>
</div>


<div id="outline-container-orgb2917d6" class="outline-2">
<h2 id="orgb2917d6"><a href="https://time.geekbang.org/column/article/2782">050 | 如何将“深度强化学习”应用到视觉问答系统？</a></h2>
<div class="outline-text-2" id="text-orgb2917d6">
<p>
今天和你分享ICCV 2017的一篇有意思的文章。这篇文章介绍了如何利用深度强化学习来搭建一个模型去理解两个机器&#x2026;
</p>
</div>
</div>


<div id="outline-container-org53f1cd3" class="outline-2">
<h2 id="org53f1cd3"><a href="https://time.geekbang.org/column/article/2771">内参特刊 | 和你聊聊每个人都关心的人工智能热点话题</a></h2>
<div class="outline-text-2" id="text-org53f1cd3">
<p>
这是我做的一场极客Live，今天和你在专栏里分享，希望其中的某些话题能够对你有所启发，也欢迎你留言和我讨论。
</p>
</div>
</div>


<div id="outline-container-org3a25603" class="outline-2">
<h2 id="org3a25603"><a href="https://time.geekbang.org/column/article/2868">051 | 精读2017年NIPS最佳研究论文之一：如何解决非凸优化问题？</a></h2>
<div class="outline-text-2" id="text-org3a25603">
<p>
对于一般的非凸优化问题来说，我们往往不能找到一个全局的最优解，甚至找到局部最优解也很困难。这篇文章就是要&#x2026;
</p>
</div>
</div>


<div id="outline-container-org2db923c" class="outline-2">
<h2 id="org2db923c"><a href="https://time.geekbang.org/column/article/2941">052 | 精读2017年NIPS最佳研究论文之二：KSD测试如何检验两个分布的异同？</a></h2>
<div class="outline-text-2" id="text-org2db923c">
<p>
今天我们要分享的这篇NIPS 2017最佳论文，讨论的是如何来衡量一组数据是否来自于某一个分布。
</p>
</div>
</div>


<div id="outline-container-org89e061c" class="outline-2">
<h2 id="org89e061c"><a href="https://time.geekbang.org/column/article/3211">053 | 精读2017年NIPS最佳研究论文之三：如何解决非完美信息博弈问题？</a></h2>
<div class="outline-text-2" id="text-org89e061c">
<p>
什么是非完美信息博弈问题？如何解决这类问题？今天我们继续分享NIPS 2017的最佳研究论文，看看在这个领域有哪&#x2026;
</p>
</div>
</div>


<div id="outline-container-org758851a" class="outline-2">
<h2 id="org758851a"><a href="https://time.geekbang.org/column/article/3261">054 | 数据科学团队养成：电话面试指南</a></h2>
<div class="outline-text-2" id="text-org758851a">
<p>
今天，我们来聊一聊组建数据科学家团队所必不可少的一个步骤：电话面试。
</p>
</div>
</div>


<div id="outline-container-org2440651" class="outline-2">
<h2 id="org2440651"><a href="https://time.geekbang.org/column/article/3361">055 | 数据科学团队养成：Onsite面试面面观</a></h2>
<div class="outline-text-2" id="text-org2440651">
<p>
Onsite面试是招聘流程中的关键点，面试中都需要考察哪些内容呢？今天我们就来聊聊Onsite面试的方方面面。
</p>
</div>
</div>


<div id="outline-container-org61e2a83" class="outline-2">
<h2 id="org61e2a83"><a href="https://time.geekbang.org/column/article/3614">056 | 成为“香饽饽”的数据科学家，如何衡量他们的工作呢？</a></h2>
<div class="outline-text-2" id="text-org61e2a83">
<p>
“数据驱动”和“持续决策”这两点可以看作是数据科学家团队的主要价值体现。那么，如何来评价数据科学家的工作&#x2026;
</p>
</div>
</div>


<div id="outline-container-org5d98c24" class="outline-2">
<h2 id="org5d98c24"><a href="https://time.geekbang.org/column/article/3744">057 | 人工智能领域知识体系更新周期只有5～6年，数据科学家如何培养？</a></h2>
<div class="outline-text-2" id="text-org5d98c24">
<p>
今天，我们来聊另一个数据科学家团队的高级话题，那就是数据科学家的培养的问题。
</p>
</div>
</div>


<div id="outline-container-org7c4df47" class="outline-2">
<h2 id="org7c4df47"><a href="https://time.geekbang.org/column/article/3909">058 | 数据科学家团队组织架构：水平还是垂直，这是个问题</a></h2>
<div class="outline-text-2" id="text-org7c4df47">
<p>
今天我们来讨论数据科学家团队高级话题中的最后一个，也是非常现实的一个问题，那就是对于一个组织来说，究竟应&#x2026;
</p>
</div>
</div>


<div id="outline-container-org5c0347d" class="outline-2">
<h2 id="org5c0347d"><a href="https://time.geekbang.org/column/article/3944">059 | 2017人工智能技术发展盘点</a></h2>
<div class="outline-text-2" id="text-org5c0347d">
<p>
在今天这个辞旧迎新的日子里，我们对过去一年的人工智能技术发展做一个简单的盘点，梳理思路，温故知新。
</p>
</div>
</div>


<div id="outline-container-org54db77c" class="outline-2">
<h2 id="org54db77c"><a href="https://time.geekbang.org/column/article/3946">060 | WSDM 2018论文精读：看谷歌团队如何做位置偏差估计</a></h2>
<div class="outline-text-2" id="text-org54db77c">
<p>
2018年的WSDM大会于2月5日到9日在的美国的洛杉矶举行。今天，我们就来分享WSDM 2018上来自谷歌的一篇文章。
</p>
</div>
</div>


<div id="outline-container-org56b2767" class="outline-2">
<h2 id="org56b2767"><a href="https://time.geekbang.org/column/article/3961">061 | WSDM 2018论文精读：看京东团队如何挖掘商品的替代信息和互补信息</a></h2>
<div class="outline-text-2" id="text-org56b2767">
<p>
今天我们来介绍WSDM 2018的最佳学生论文，这篇文章来自于京东的数据科学实验室。
</p>
</div>
</div>


<div id="outline-container-org72abcf9" class="outline-2">
<h2 id="org72abcf9"><a href="https://time.geekbang.org/column/article/4024">062 | WSDM 2018论文精读：深度学习模型中如何使用上下文信息？</a></h2>
<div class="outline-text-2" id="text-org72abcf9">
<p>
今天，我们继续来精读WSDM 2018的一篇来自谷歌团队的论文，其核心思想是希望能够在深度模型的架构上模拟出“交&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgdf9a8ee" class="outline-2">
<h2 id="orgdf9a8ee"><a href="https://time.geekbang.org/column/article/3215">复盘 1 | 搜索核心技术模块</a></h2>
<div class="outline-text-2" id="text-orgdf9a8ee">
<p>
今天我们对搜索核心技术模块做一个复盘。在这个模块，我们一起学习了27期内容，你已经阅读了70047字，听了220分&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgbaae8db" class="outline-2">
<h2 id="orgbaae8db"><a href="https://time.geekbang.org/column/article/4090">063 | 简单推荐模型之一：基于流行度的推荐模型</a></h2>
<div class="outline-text-2" id="text-orgbaae8db">
<p>
今天，我们正式进入专栏的另一个比较大的模块，那就是推荐系统，一起来看推荐系统有哪些技术要点。
</p>
</div>
</div>


<div id="outline-container-orgd33a278" class="outline-2">
<h2 id="orgd33a278"><a href="https://time.geekbang.org/column/article/4212">064 | 简单推荐模型之二：基于相似信息的推荐模型</a></h2>
<div class="outline-text-2" id="text-orgd33a278">
<p>
今天，我们来看另外一种简单但很有效果的推荐模型：基于相似信息的推荐模型。
</p>
</div>
</div>


<div id="outline-container-orgd706a3d" class="outline-2">
<h2 id="orgd706a3d"><a href="https://time.geekbang.org/column/article/4278">065 | 简单推荐模型之三：基于内容信息的推荐模型</a></h2>
<div class="outline-text-2" id="text-orgd706a3d">
<p>
所谓基于内容信息的推荐系统，其实就是用特征来表示用户、物品以及用户和物品的交互，从而能够把推荐问题转换成&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgd03cd14" class="outline-2">
<h2 id="orgd03cd14"><a href="https://time.geekbang.org/column/article/4421">066 | 基于隐变量的模型之一：矩阵分解</a></h2>
<div class="outline-text-2" id="text-orgd03cd14">
<p>
今天我为你讲解推荐系统的一个重要分支，隐变量模型。我们从矩阵分解这个基本模型讲起。
</p>
</div>
</div>


<div id="outline-container-org0870644" class="outline-2">
<h2 id="org0870644"><a href="https://time.geekbang.org/column/article/4484">067 | 基于隐变量的模型之二：基于回归的矩阵分解</a></h2>
<div class="outline-text-2" id="text-org0870644">
<p>
今天我们来分享基于回归的矩阵分解模型，这是在基本矩阵分解的基础上衍生出来的一类模型。
</p>
</div>
</div>


<div id="outline-container-org152b79b" class="outline-2">
<h2 id="org152b79b"><a href="https://time.geekbang.org/column/article/4569">068 | 基于隐变量的模型之三：分解机</a></h2>
<div class="outline-text-2" id="text-org152b79b">
<p>
今天，我们来介绍一种叫作“分解机”的推荐技术。在最近几年的Kaggle比赛中以及一些工业级的应用中，分解机凭借&#x2026;
</p>
</div>
</div>


<div id="outline-container-org06c08d7" class="outline-2">
<h2 id="org06c08d7"><a href="https://time.geekbang.org/column/article/4680">069 | 高级推荐模型之一：张量分解模型</a></h2>
<div class="outline-text-2" id="text-org06c08d7">
<p>
今天，我们来聊聊“张量分解”模型，这是一种比较高级的推荐系统模型，看它如何抓住更多的用户和物品之间的关系&#x2026;
</p>
</div>
</div>


<div id="outline-container-org2115b37" class="outline-2">
<h2 id="org2115b37"><a href="https://time.geekbang.org/column/article/4764">070 | 高级推荐模型之二：协同矩阵分解</a></h2>
<div class="outline-text-2" id="text-org2115b37">
<p>
今天我为你讲了推荐系统的另一个高级模型，协同矩阵分解，用来对不同类型的二元信息进行建模。
</p>
</div>
</div>


<div id="outline-container-org3ebda94" class="outline-2">
<h2 id="org3ebda94"><a href="https://time.geekbang.org/column/article/4784">071 | 高级推荐模型之三：优化复杂目标函数</a></h2>
<div class="outline-text-2" id="text-org3ebda94">
<p>
今天我们来讨论推荐系统的另外一个问题，目标函数。我们为什么要关注目标函数？以评分为基础的目标函数存在什么&#x2026;
</p>
</div>
</div>


<div id="outline-container-org5571b66" class="outline-2">
<h2 id="org5571b66"><a href="https://time.geekbang.org/column/article/4881">072 | 推荐的Exploit和Explore算法之一：EE算法综述</a></h2>
<div class="outline-text-2" id="text-org5571b66">
<p>
这周，我们来看一个完全不同的话题，那就是Exploitation（利用）和Exploration（探索）的策略，俗称“EE策略”&#x2026;
</p>
</div>
</div>


<div id="outline-container-org5c29551" class="outline-2">
<h2 id="org5c29551"><a href="https://time.geekbang.org/column/article/4903">073 | 推荐的Exploit和Explore算法之二：UCB算法</a></h2>
<div class="outline-text-2" id="text-org5c29551">
<p>
今天我们来看EE策略中一种最基本的思路，叫UCB（Upper Confidence Bound）算法。
</p>
</div>
</div>


<div id="outline-container-org52a447f" class="outline-2">
<h2 id="org52a447f"><a href="https://time.geekbang.org/column/article/4915">074 | 推荐的Exploit和Explore算法之三：汤普森采样算法</a></h2>
<div class="outline-text-2" id="text-org52a447f">
<p>
今天我们来分享汤普森采样算法，看它如何解决确定性算法存在的问题。
</p>
</div>
</div>


<div id="outline-container-org5d35dbe" class="outline-2">
<h2 id="org5d35dbe"><a href="https://time.geekbang.org/column/article/5075">075 | 推荐系统评测之一：传统线下评测</a></h2>
<div class="outline-text-2" id="text-org5d35dbe">
<p>
这周，我们回归到一个更加传统的话题，那就是如何评测推荐系统。今天，我们先来看一看推荐系统的线下评测。
</p>
</div>
</div>


<div id="outline-container-org39306a8" class="outline-2">
<h2 id="org39306a8"><a href="https://time.geekbang.org/column/article/5117">076 | 推荐系统评测之二：线上评测</a></h2>
<div class="outline-text-2" id="text-org39306a8">
<p>
今天，我们来讨论推荐系统的线上评测。在线上评测的时候需要注意什么呢？
</p>
</div>
</div>


<div id="outline-container-org96aa9a6" class="outline-2">
<h2 id="org96aa9a6"><a href="https://time.geekbang.org/column/article/5221">077 | 推荐系统评测之三：无偏差估计</a></h2>
<div class="outline-text-2" id="text-org96aa9a6">
<p>
今天，我们来看一个比较高级的话题，那就是如何做到推荐系统的无偏差估计。
</p>
</div>
</div>


<div id="outline-container-orgaf1c714" class="outline-2">
<h2 id="orgaf1c714"><a href="https://time.geekbang.org/column/article/5434">078 | 现代推荐架构剖析之一：基于线下离线计算的推荐架构</a></h2>
<div class="outline-text-2" id="text-orgaf1c714">
<p>
本周我们来谈现代推荐系统的架构体系，今天先从基于线下离线计算的推荐架构说起。
</p>
</div>
</div>


<div id="outline-container-org3176c9f" class="outline-2">
<h2 id="org3176c9f"><a href="https://time.geekbang.org/column/article/5519">079 | 现代推荐架构剖析之二：基于多层搜索架构的推荐系统</a></h2>
<div class="outline-text-2" id="text-org3176c9f">
<p>
今天，我们来看另外一种也很常见的推荐系统架构，那就是基于多层搜索架构的推荐系统。
</p>
</div>
</div>


<div id="outline-container-org72ad1a1" class="outline-2">
<h2 id="org72ad1a1"><a href="https://time.geekbang.org/column/article/5571">080 | 现代推荐架构剖析之三：复杂现代推荐架构漫谈</a></h2>
<div class="outline-text-2" id="text-org72ad1a1">
<p>
我们通过两个场景，新用户多和新物品多，来分析推荐架构里面的一些取舍。
</p>
</div>
</div>


<div id="outline-container-org3f97727" class="outline-2">
<h2 id="org3f97727"><a href="https://time.geekbang.org/column/article/5624">081 | 基于深度学习的推荐模型之一：受限波兹曼机</a></h2>
<div class="outline-text-2" id="text-org3f97727">
<p>
这周，我们来讨论如何利用深度学习来提升推荐系统的精度。
</p>
</div>
</div>
