src/geekbang-ai-internal-reference.org
** [[https://time.geekbang.org/column/article/5646][082 | 基于深度学习的推荐模型之二：基于RNN的推荐系统]]

今天，我们来看RNN“递归神经网络”在推荐系统中的应用。


** [[https://time.geekbang.org/column/article/5709][083 | 基于深度学习的推荐模型之三：利用深度学习来扩展推荐系统]]

今天，我们一起来看还有哪些深度学习的思潮在影响着推荐系统。


** [[https://time.geekbang.org/column/article/5915][复盘 2 | 推荐系统核心技术模块]]

今天我们对推荐系统核心技术模块做一个复盘。在这个模块里，我们一起学习了21期内容，阅读了 45397字，听了138...


** [[https://time.geekbang.org/column/article/5998][084 | LDA变种模型知多少]]

今天我们就结合几篇经典论文，来看一看LDA的各种扩展模型。


** [[https://time.geekbang.org/column/article/6024][085 | 针对大规模数据，如何优化LDA算法？]]

今天我们一起讨论LDA的算法优化问题，看如何能够把LDA真正应用到工业级的场景中。


** [[https://time.geekbang.org/column/article/6190][086 | 基础文本分析模型之一：隐语义分析]]

今天我们一起来讨论一个基础文本分析模型，隐语义分析。


** [[https://time.geekbang.org/column/article/6274][087 | 基础文本分析模型之二：概率隐语义分析]]

是否能够把概率的语言移植到隐语义分析上呢？今天我们就来讨论“概率隐语义分析”这个模型。


** [[https://time.geekbang.org/column/article/6366][088 | 基础文本分析模型之三：EM算法]]

不管是PLSA，还是LDA，其模型的训练过程都依赖或者间接依赖一个算法，即EM算法，今天我们就来聊聊这个算法的一...


** [[https://time.geekbang.org/column/article/6430][089 | 为什么需要Word2Vec算法？]]

今天，我们进入文本分析的另外一个环节，介绍一个最近几年兴起的重要文本模型，Word2Vec。


** [[https://time.geekbang.org/column/article/6578][090 | Word2Vec算法有哪些扩展模型？]]

今天我们继续讨论Word2Vec模型，看其有哪些重要的扩展模型。


** [[https://time.geekbang.org/column/article/6586][091 | Word2Vec算法有哪些应用？]]

今天，我们来看一看Word2Vec算法在自然语言处理领域的一些应用。


** [[https://time.geekbang.org/column/article/6681][092 | 序列建模的深度学习利器：RNN基础架构]]

为什么需要对文本的序列数据进行建模？一起来看序列建模的深度学习利器RNN。


** [[https://time.geekbang.org/column/article/6840][093 | 基于门机制的RNN架构：LSTM与GRU]]

今天我们就进一步展开RNN这个基本框架，看一看在当下都有哪些流行的RNN模型实现。


** [[https://time.geekbang.org/column/article/6925][094 | RNN在自然语言处理中有哪些应用场景？]]

今天，我来为你介绍文本序列建模利器RNN的几个应用场景。


** [[https://time.geekbang.org/column/article/7144][095 | 对话系统之经典的对话模型]]

今天，我们要来看另外一类和文字相关的人工智能系统，也就是对话系统的一些基础知识。


** [[https://time.geekbang.org/column/article/7326][096 | 任务型对话系统有哪些技术要点？]]

今天，我们一起来看基于任务的对话系统有哪些技术要点。


** [[https://time.geekbang.org/column/article/7423][097 | 聊天机器人有哪些核心技术要点？]]

今天，我们就来讨论“聊天机器人”，也就是非任务型对话系统的主要技术要点。


** [[https://time.geekbang.org/column/article/7649][098 | 什么是文档情感分类？]]

今天，我们转入文本分析的另外一个领域：文本“情感分析”。我们首先从最基础的文档情感分类这个问题说起。


** [[https://time.geekbang.org/column/article/7757][099 | 如何来提取情感“实体”和“方面”呢？]]

今天，我们来看文本情感分析中的另一个关键技术，情感“实体”和“方面”的提取。


** [[https://time.geekbang.org/column/article/7954][100 | 文本情感分析中如何做意见总结和搜索？]]

今天，我们来看文本情感分析的另外一个主题：意见总结和意见搜索。


** [[https://time.geekbang.org/column/article/8106][101 | The Web 2018论文精读：如何对商品的图片美感进行建模？]]

“万维网大会”是Google学术“信息系统”排名第一的国际顶级学术会议。今天，我来为你解读今年万维网大会的一篇...


** [[https://time.geekbang.org/column/article/8234][102 | The Web 2018论文精读：如何改进经典的推荐算法BPR？]]

今天，我们来看万维网大会上的一篇优秀短论文，讨论对贝叶斯个性化排序的一种改进。


** [[https://time.geekbang.org/column/article/8293][103 | The Web 2018论文精读：如何从文本中提取高元关系？]]

今天我们来看 The Web 2018的最佳论文，这篇文章介绍了如何从文本中提取高元关系，这是一个比较新的研究领域...


** [[https://time.geekbang.org/column/article/8480][104 | 如何快速学习国际顶级学术会议的内容？]]

国际顶级会议内容丰富，包括论文、讲座、研讨班等，如何快速学习到这些会议的内容呢？今天我就结合自己的经验来...


** [[https://time.geekbang.org/column/article/8553][复盘 3 | 自然语言处理及文本处理核心技术模块]]

今天我们对自然语言处理及文本处理核心技术模块做一个复盘。在这个模块里，我们一起学习了18期内容，阅读了3769...


** [[https://time.geekbang.org/column/article/8601][105 | 广告系统概述]]

从今天起，我们来看另一个重要的应用领域：计算广告。我们首先来聊一聊广告系统的概述，看一下这个领域要解决的...


** [[https://time.geekbang.org/column/article/8691][106 | 广告系统架构]]

今天，我们来更加细致地看一看广告系统的架构，熟悉各个组件都是怎么运作的。


** [[https://time.geekbang.org/column/article/8913][107 | 广告回馈预估综述]]

今天，我们就来看一看整个计算广告领域最核心的一个问题：广告回馈预估。


** [[https://time.geekbang.org/column/article/9037][108 | Facebook的广告点击率预估模型]]

今天，我们就来看一个广告回馈预估的实例：Facebook的广告点击率预估。


** [[https://time.geekbang.org/column/article/9069][109 | 雅虎的广告点击率预估模型]]

今天，我们来分析另外一个经典的公司实例：雅虎的广告点击率预估模型。


** [[https://time.geekbang.org/column/article/9264][110 | LinkedIn的广告点击率预估模型]]

今天，我们继续来分析案例，看看LinkedIn这家公司是怎么来做最基本的广告预估的。


** [[https://time.geekbang.org/column/article/9370][111 | Twitter的广告点击率预估模型]]

社交广告就是在社交媒体的用户信息流里投放广告。今天我们就来看看Twitter的广告预估是怎么做的。


** [[https://time.geekbang.org/column/article/9488][112 | 阿里巴巴的广告点击率预估模型]]

今天，我们来看阿里巴巴的广告预估又有哪些值得我们学习的地方。


** [[https://time.geekbang.org/column/article/9695][113 | 什么是“基于第二价位的广告竞拍”？]]

今天我们来讲计算广告中非常重要的广告竞价排名，先来看看被广泛使用的基于第二价位的广告竞拍。


** [[https://time.geekbang.org/column/article/9747][114 | 广告的竞价策略是怎样的？]]

今天我们来看在基于第二价位的广告竞拍的基础上，DSP或者广告商究竟该如何形成自己的竞价策略呢？


** [[https://time.geekbang.org/column/article/9864][115 | 如何优化广告的竞价策略？]]

今天我们从单个和多个广告推广计划的优化角度，来聊一聊具体的竞价策略方法。


** [[https://time.geekbang.org/column/article/10029][116 | 如何控制广告预算？]]

今天，我们来看在广告竞价策略中一个比较重要的问题，如何控制广告预算？


** [[https://time.geekbang.org/column/article/10147][117 | 如何设置广告竞价的底价？]]

今天，我们来看一个发布商在广告竞价流程中可以参与调优的地方，聊一聊广告竞价中的底价优化。


** [[https://time.geekbang.org/column/article/10182][118 | 聊一聊“程序化直接购买”和“广告期货”]]

今天，我们来看关于计算广告竞价的另外两个话题：一个是程序化直接购买，另一个是广告期货。


