html/geekbang-ai-internal-reference.html


<div id="outline-container-orgb017997" class="outline-2">
<h2 id="orgb017997"><a href="https://time.geekbang.org/column/article/5646">082 | 基于深度学习的推荐模型之二：基于RNN的推荐系统</a></h2>
<div class="outline-text-2" id="text-orgb017997">
<p>
今天，我们来看RNN“递归神经网络”在推荐系统中的应用。
</p>
</div>
</div>


<div id="outline-container-orgaa24b8c" class="outline-2">
<h2 id="orgaa24b8c"><a href="https://time.geekbang.org/column/article/5709">083 | 基于深度学习的推荐模型之三：利用深度学习来扩展推荐系统</a></h2>
<div class="outline-text-2" id="text-orgaa24b8c">
<p>
今天，我们一起来看还有哪些深度学习的思潮在影响着推荐系统。
</p>
</div>
</div>


<div id="outline-container-org9b660d3" class="outline-2">
<h2 id="org9b660d3"><a href="https://time.geekbang.org/column/article/5915">复盘 2 | 推荐系统核心技术模块</a></h2>
<div class="outline-text-2" id="text-org9b660d3">
<p>
今天我们对推荐系统核心技术模块做一个复盘。在这个模块里，我们一起学习了21期内容，阅读了 45397字，听了138&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgb383df5" class="outline-2">
<h2 id="orgb383df5"><a href="https://time.geekbang.org/column/article/5998">084 | LDA变种模型知多少</a></h2>
<div class="outline-text-2" id="text-orgb383df5">
<p>
今天我们就结合几篇经典论文，来看一看LDA的各种扩展模型。
</p>
</div>
</div>


<div id="outline-container-orgfa8109c" class="outline-2">
<h2 id="orgfa8109c"><a href="https://time.geekbang.org/column/article/6024">085 | 针对大规模数据，如何优化LDA算法？</a></h2>
<div class="outline-text-2" id="text-orgfa8109c">
<p>
今天我们一起讨论LDA的算法优化问题，看如何能够把LDA真正应用到工业级的场景中。
</p>
</div>
</div>


<div id="outline-container-orgbfa0ef4" class="outline-2">
<h2 id="orgbfa0ef4"><a href="https://time.geekbang.org/column/article/6190">086 | 基础文本分析模型之一：隐语义分析</a></h2>
<div class="outline-text-2" id="text-orgbfa0ef4">
<p>
今天我们一起来讨论一个基础文本分析模型，隐语义分析。
</p>
</div>
</div>


<div id="outline-container-org2dd2745" class="outline-2">
<h2 id="org2dd2745"><a href="https://time.geekbang.org/column/article/6274">087 | 基础文本分析模型之二：概率隐语义分析</a></h2>
<div class="outline-text-2" id="text-org2dd2745">
<p>
是否能够把概率的语言移植到隐语义分析上呢？今天我们就来讨论“概率隐语义分析”这个模型。
</p>
</div>
</div>


<div id="outline-container-orga424fee" class="outline-2">
<h2 id="orga424fee"><a href="https://time.geekbang.org/column/article/6366">088 | 基础文本分析模型之三：EM算法</a></h2>
<div class="outline-text-2" id="text-orga424fee">
<p>
不管是PLSA，还是LDA，其模型的训练过程都依赖或者间接依赖一个算法，即EM算法，今天我们就来聊聊这个算法的一&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgcf2b8ba" class="outline-2">
<h2 id="orgcf2b8ba"><a href="https://time.geekbang.org/column/article/6430">089 | 为什么需要Word2Vec算法？</a></h2>
<div class="outline-text-2" id="text-orgcf2b8ba">
<p>
今天，我们进入文本分析的另外一个环节，介绍一个最近几年兴起的重要文本模型，Word2Vec。
</p>
</div>
</div>


<div id="outline-container-org8f6882d" class="outline-2">
<h2 id="org8f6882d"><a href="https://time.geekbang.org/column/article/6578">090 | Word2Vec算法有哪些扩展模型？</a></h2>
<div class="outline-text-2" id="text-org8f6882d">
<p>
今天我们继续讨论Word2Vec模型，看其有哪些重要的扩展模型。
</p>
</div>
</div>


<div id="outline-container-org64a8c72" class="outline-2">
<h2 id="org64a8c72"><a href="https://time.geekbang.org/column/article/6586">091 | Word2Vec算法有哪些应用？</a></h2>
<div class="outline-text-2" id="text-org64a8c72">
<p>
今天，我们来看一看Word2Vec算法在自然语言处理领域的一些应用。
</p>
</div>
</div>


<div id="outline-container-org1852c86" class="outline-2">
<h2 id="org1852c86"><a href="https://time.geekbang.org/column/article/6681">092 | 序列建模的深度学习利器：RNN基础架构</a></h2>
<div class="outline-text-2" id="text-org1852c86">
<p>
为什么需要对文本的序列数据进行建模？一起来看序列建模的深度学习利器RNN。
</p>
</div>
</div>


<div id="outline-container-orgd9e34d0" class="outline-2">
<h2 id="orgd9e34d0"><a href="https://time.geekbang.org/column/article/6840">093 | 基于门机制的RNN架构：LSTM与GRU</a></h2>
<div class="outline-text-2" id="text-orgd9e34d0">
<p>
今天我们就进一步展开RNN这个基本框架，看一看在当下都有哪些流行的RNN模型实现。
</p>
</div>
</div>


<div id="outline-container-org031bc1f" class="outline-2">
<h2 id="org031bc1f"><a href="https://time.geekbang.org/column/article/6925">094 | RNN在自然语言处理中有哪些应用场景？</a></h2>
<div class="outline-text-2" id="text-org031bc1f">
<p>
今天，我来为你介绍文本序列建模利器RNN的几个应用场景。
</p>
</div>
</div>


<div id="outline-container-org2653faa" class="outline-2">
<h2 id="org2653faa"><a href="https://time.geekbang.org/column/article/7144">095 | 对话系统之经典的对话模型</a></h2>
<div class="outline-text-2" id="text-org2653faa">
<p>
今天，我们要来看另外一类和文字相关的人工智能系统，也就是对话系统的一些基础知识。
</p>
</div>
</div>


<div id="outline-container-orgbdc732e" class="outline-2">
<h2 id="orgbdc732e"><a href="https://time.geekbang.org/column/article/7326">096 | 任务型对话系统有哪些技术要点？</a></h2>
<div class="outline-text-2" id="text-orgbdc732e">
<p>
今天，我们一起来看基于任务的对话系统有哪些技术要点。
</p>
</div>
</div>


<div id="outline-container-org7630415" class="outline-2">
<h2 id="org7630415"><a href="https://time.geekbang.org/column/article/7423">097 | 聊天机器人有哪些核心技术要点？</a></h2>
<div class="outline-text-2" id="text-org7630415">
<p>
今天，我们就来讨论“聊天机器人”，也就是非任务型对话系统的主要技术要点。
</p>
</div>
</div>


<div id="outline-container-org17a0c1f" class="outline-2">
<h2 id="org17a0c1f"><a href="https://time.geekbang.org/column/article/7649">098 | 什么是文档情感分类？</a></h2>
<div class="outline-text-2" id="text-org17a0c1f">
<p>
今天，我们转入文本分析的另外一个领域：文本“情感分析”。我们首先从最基础的文档情感分类这个问题说起。
</p>
</div>
</div>


<div id="outline-container-org94584dc" class="outline-2">
<h2 id="org94584dc"><a href="https://time.geekbang.org/column/article/7757">099 | 如何来提取情感“实体”和“方面”呢？</a></h2>
<div class="outline-text-2" id="text-org94584dc">
<p>
今天，我们来看文本情感分析中的另一个关键技术，情感“实体”和“方面”的提取。
</p>
</div>
</div>


<div id="outline-container-org8fb95ca" class="outline-2">
<h2 id="org8fb95ca"><a href="https://time.geekbang.org/column/article/7954">100 | 文本情感分析中如何做意见总结和搜索？</a></h2>
<div class="outline-text-2" id="text-org8fb95ca">
<p>
今天，我们来看文本情感分析的另外一个主题：意见总结和意见搜索。
</p>
</div>
</div>


<div id="outline-container-org893b498" class="outline-2">
<h2 id="org893b498"><a href="https://time.geekbang.org/column/article/8106">101 | The Web 2018论文精读：如何对商品的图片美感进行建模？</a></h2>
<div class="outline-text-2" id="text-org893b498">
<p>
“万维网大会”是Google学术“信息系统”排名第一的国际顶级学术会议。今天，我来为你解读今年万维网大会的一篇&#x2026;
</p>
</div>
</div>


<div id="outline-container-org462bf65" class="outline-2">
<h2 id="org462bf65"><a href="https://time.geekbang.org/column/article/8234">102 | The Web 2018论文精读：如何改进经典的推荐算法BPR？</a></h2>
<div class="outline-text-2" id="text-org462bf65">
<p>
今天，我们来看万维网大会上的一篇优秀短论文，讨论对贝叶斯个性化排序的一种改进。
</p>
</div>
</div>


<div id="outline-container-orga3d1c34" class="outline-2">
<h2 id="orga3d1c34"><a href="https://time.geekbang.org/column/article/8293">103 | The Web 2018论文精读：如何从文本中提取高元关系？</a></h2>
<div class="outline-text-2" id="text-orga3d1c34">
<p>
今天我们来看 The Web 2018的最佳论文，这篇文章介绍了如何从文本中提取高元关系，这是一个比较新的研究领域&#x2026;
</p>
</div>
</div>


<div id="outline-container-org97b0b28" class="outline-2">
<h2 id="org97b0b28"><a href="https://time.geekbang.org/column/article/8480">104 | 如何快速学习国际顶级学术会议的内容？</a></h2>
<div class="outline-text-2" id="text-org97b0b28">
<p>
国际顶级会议内容丰富，包括论文、讲座、研讨班等，如何快速学习到这些会议的内容呢？今天我就结合自己的经验来&#x2026;
</p>
</div>
</div>


<div id="outline-container-org5ed7875" class="outline-2">
<h2 id="org5ed7875"><a href="https://time.geekbang.org/column/article/8553">复盘 3 | 自然语言处理及文本处理核心技术模块</a></h2>
<div class="outline-text-2" id="text-org5ed7875">
<p>
今天我们对自然语言处理及文本处理核心技术模块做一个复盘。在这个模块里，我们一起学习了18期内容，阅读了3769&#x2026;
</p>
</div>
</div>


<div id="outline-container-org1c0ff00" class="outline-2">
<h2 id="org1c0ff00"><a href="https://time.geekbang.org/column/article/8601">105 | 广告系统概述</a></h2>
<div class="outline-text-2" id="text-org1c0ff00">
<p>
从今天起，我们来看另一个重要的应用领域：计算广告。我们首先来聊一聊广告系统的概述，看一下这个领域要解决的&#x2026;
</p>
</div>
</div>


<div id="outline-container-org623ec7e" class="outline-2">
<h2 id="org623ec7e"><a href="https://time.geekbang.org/column/article/8691">106 | 广告系统架构</a></h2>
<div class="outline-text-2" id="text-org623ec7e">
<p>
今天，我们来更加细致地看一看广告系统的架构，熟悉各个组件都是怎么运作的。
</p>
</div>
</div>


<div id="outline-container-orga69f365" class="outline-2">
<h2 id="orga69f365"><a href="https://time.geekbang.org/column/article/8913">107 | 广告回馈预估综述</a></h2>
<div class="outline-text-2" id="text-orga69f365">
<p>
今天，我们就来看一看整个计算广告领域最核心的一个问题：广告回馈预估。
</p>
</div>
</div>


<div id="outline-container-org2cdf590" class="outline-2">
<h2 id="org2cdf590"><a href="https://time.geekbang.org/column/article/9037">108 | Facebook的广告点击率预估模型</a></h2>
<div class="outline-text-2" id="text-org2cdf590">
<p>
今天，我们就来看一个广告回馈预估的实例：Facebook的广告点击率预估。
</p>
</div>
</div>


<div id="outline-container-orgaed7e26" class="outline-2">
<h2 id="orgaed7e26"><a href="https://time.geekbang.org/column/article/9069">109 | 雅虎的广告点击率预估模型</a></h2>
<div class="outline-text-2" id="text-orgaed7e26">
<p>
今天，我们来分析另外一个经典的公司实例：雅虎的广告点击率预估模型。
</p>
</div>
</div>


<div id="outline-container-orgcf3e86f" class="outline-2">
<h2 id="orgcf3e86f"><a href="https://time.geekbang.org/column/article/9264">110 | LinkedIn的广告点击率预估模型</a></h2>
<div class="outline-text-2" id="text-orgcf3e86f">
<p>
今天，我们继续来分析案例，看看LinkedIn这家公司是怎么来做最基本的广告预估的。
</p>
</div>
</div>


<div id="outline-container-orgfbd0e4d" class="outline-2">
<h2 id="orgfbd0e4d"><a href="https://time.geekbang.org/column/article/9370">111 | Twitter的广告点击率预估模型</a></h2>
<div class="outline-text-2" id="text-orgfbd0e4d">
<p>
社交广告就是在社交媒体的用户信息流里投放广告。今天我们就来看看Twitter的广告预估是怎么做的。
</p>
</div>
</div>


<div id="outline-container-orgd63dc5b" class="outline-2">
<h2 id="orgd63dc5b"><a href="https://time.geekbang.org/column/article/9488">112 | 阿里巴巴的广告点击率预估模型</a></h2>
<div class="outline-text-2" id="text-orgd63dc5b">
<p>
今天，我们来看阿里巴巴的广告预估又有哪些值得我们学习的地方。
</p>
</div>
</div>


<div id="outline-container-org11cc097" class="outline-2">
<h2 id="org11cc097"><a href="https://time.geekbang.org/column/article/9695">113 | 什么是“基于第二价位的广告竞拍”？</a></h2>
<div class="outline-text-2" id="text-org11cc097">
<p>
今天我们来讲计算广告中非常重要的广告竞价排名，先来看看被广泛使用的基于第二价位的广告竞拍。
</p>
</div>
</div>


<div id="outline-container-orge63f5c8" class="outline-2">
<h2 id="orge63f5c8"><a href="https://time.geekbang.org/column/article/9747">114 | 广告的竞价策略是怎样的？</a></h2>
<div class="outline-text-2" id="text-orge63f5c8">
<p>
今天我们来看在基于第二价位的广告竞拍的基础上，DSP或者广告商究竟该如何形成自己的竞价策略呢？
</p>
</div>
</div>


<div id="outline-container-org0107e04" class="outline-2">
<h2 id="org0107e04"><a href="https://time.geekbang.org/column/article/9864">115 | 如何优化广告的竞价策略？</a></h2>
<div class="outline-text-2" id="text-org0107e04">
<p>
今天我们从单个和多个广告推广计划的优化角度，来聊一聊具体的竞价策略方法。
</p>
</div>
</div>


<div id="outline-container-org85e5bb4" class="outline-2">
<h2 id="org85e5bb4"><a href="https://time.geekbang.org/column/article/10029">116 | 如何控制广告预算？</a></h2>
<div class="outline-text-2" id="text-org85e5bb4">
<p>
今天，我们来看在广告竞价策略中一个比较重要的问题，如何控制广告预算？
</p>
</div>
</div>


<div id="outline-container-org4cd7484" class="outline-2">
<h2 id="org4cd7484"><a href="https://time.geekbang.org/column/article/10147">117 | 如何设置广告竞价的底价？</a></h2>
<div class="outline-text-2" id="text-org4cd7484">
<p>
今天，我们来看一个发布商在广告竞价流程中可以参与调优的地方，聊一聊广告竞价中的底价优化。
</p>
</div>
</div>


<div id="outline-container-org51632a1" class="outline-2">
<h2 id="org51632a1"><a href="https://time.geekbang.org/column/article/10182">118 | 聊一聊“程序化直接购买”和“广告期货”</a></h2>
<div class="outline-text-2" id="text-org51632a1">
<p>
今天，我们来看关于计算广告竞价的另外两个话题：一个是程序化直接购买，另一个是广告期货。
</p>
</div>
</div>
