html/geekbang-ai-internal-reference.html


<div id="outline-container-org92266a7" class="outline-2">
<h2 id="org92266a7"><a href="https://time.geekbang.org/column/article/10360">119 | 归因模型：如何来衡量广告的有效性</a></h2>
<div class="outline-text-2" id="text-org92266a7">
<p>
从今天开始我们来讨论一些计算广告相关的高级话题，就从归因模型聊起。
</p>
</div>
</div>


<div id="outline-container-orgaccaf45" class="outline-2">
<h2 id="orgaccaf45"><a href="https://time.geekbang.org/column/article/10599">120 | 广告投放如何选择受众？如何扩展受众群？</a></h2>
<div class="outline-text-2" id="text-orgaccaf45">
<p>
今天我们来讨论受众扩展技术，也就是如何帮助广告商扩大受众群。
</p>
</div>
</div>


<div id="outline-container-org169e6bc" class="outline-2">
<h2 id="org169e6bc"><a href="https://time.geekbang.org/column/article/10719">121 | 如何利用机器学习技术来检测广告欺诈？</a></h2>
<div class="outline-text-2" id="text-org169e6bc">
<p>
今天我们来聊一聊广告中一个非常棘手，同时也是一个非常实际的问题：欺诈检测。
</p>
</div>
</div>


<div id="outline-container-org96eb82f" class="outline-2">
<h2 id="org96eb82f"><a href="https://time.geekbang.org/column/article/10801">122 | 数据科学家必备套路之一：搜索套路</a></h2>
<div class="outline-text-2" id="text-org96eb82f">
<p>
我们已经讨论了很多模型，但是想要把这些模型得心应手地应用到真实场景中，绝非易事。今天我们就从做搜索产品的&#x2026;
</p>
</div>
</div>


<div id="outline-container-org0fa5d40" class="outline-2">
<h2 id="org0fa5d40"><a href="https://time.geekbang.org/column/article/10972">123 | 数据科学家必备套路之二：推荐套路</a></h2>
<div class="outline-text-2" id="text-org0fa5d40">
<p>
今天我们来聊聊做推荐产品的一些套路。
</p>
</div>
</div>


<div id="outline-container-org54a5c6b" class="outline-2">
<h2 id="org54a5c6b"><a href="https://time.geekbang.org/column/article/11307">124 | 数据科学家必备套路之三：广告套路</a></h2>
<div class="outline-text-2" id="text-org54a5c6b">
<p>
讲完了搜索产品和推荐系统的套路，今天我们继续来看数据科学家应该掌握的广告产品的一些套路。
</p>
</div>
</div>


<div id="outline-container-orgbcf6ca5" class="outline-2">
<h2 id="orgbcf6ca5"><a href="https://time.geekbang.org/column/article/11367">125 | SIGIR 2018论文精读：偏差和“流行度”之间的关系</a></h2>
<div class="outline-text-2" id="text-orgbcf6ca5">
<p>
从今天开始，我将精选几篇SIGIR 2018上最有价值的论文，和你一起来读。
</p>
</div>
</div>


<div id="outline-container-org2f42a12" class="outline-2">
<h2 id="org2f42a12"><a href="https://time.geekbang.org/column/article/11636">126 | SIGIR 2018论文精读：如何利用对抗学习来增强排序模型的普适性？</a></h2>
<div class="outline-text-2" id="text-org2f42a12">
<p>
今天，我们一起来精读SIGIR 2018的最佳短论文，聊一聊如何利用对抗学习来增强排序模型的普适性。
</p>
</div>
</div>


<div id="outline-container-org3f8985e" class="outline-2">
<h2 id="org3f8985e"><a href="https://time.geekbang.org/column/article/11851">127 | SIGIR 2018论文精读：如何对搜索页面上的点击行为进行序列建模？</a></h2>
<div class="outline-text-2" id="text-org3f8985e">
<p>
今天我们继续来精读SIGIR 2018的论文，来聊一聊如何针对用户在搜索页面上的点击行为进行建模。
</p>
</div>
</div>


<div id="outline-container-orgabbbc2a" class="outline-2">
<h2 id="orgabbbc2a"><a href="https://time.geekbang.org/column/article/12010">128 | CVPR 2018论文精读：如何研究计算机视觉任务之间的关系？</a></h2>
<div class="outline-text-2" id="text-orgabbbc2a">
<p>
CVPR（计算机视觉和模式识别大会）人工智能领域的盛会。今天我来和你分享今年大会的最佳论文。
</p>
</div>
</div>


<div id="outline-container-org0912339" class="outline-2">
<h2 id="org0912339"><a href="https://time.geekbang.org/column/article/12100">129 | CVPR 2018论文精读：如何从整体上对人体进行三维建模？</a></h2>
<div class="outline-text-2" id="text-org0912339">
<p>
今天我们来分享今年CVPR大会的最佳学生论文，讨论跟踪人体面部表情，手势和身体运动的三维模型。
</p>
</div>
</div>


<div id="outline-container-orgb08b506" class="outline-2">
<h2 id="orgb08b506"><a href="https://time.geekbang.org/column/article/12190">130 | CVPR 2018论文精读：如何解决排序学习计算复杂度高这个问题？</a></h2>
<div class="outline-text-2" id="text-orgb08b506">
<p>
今天我来分享这次大会的一篇最佳论文提名，这篇论文对于排序学习的算法有重大改进，是一个很重要的贡献。
</p>
</div>
</div>


<div id="outline-container-org3475de2" class="outline-2">
<h2 id="org3475de2"><a href="https://time.geekbang.org/column/article/12443">131 | ICML 2018论文精读：模型经得起对抗样本的攻击？这或许只是个错觉</a></h2>
<div class="outline-text-2" id="text-org3475de2">
<p>
ICML是机器学习、人工智能领域的顶级会议。今天和你分享ICML 2018的最佳论文，聊一个有趣的话题。
</p>
</div>
</div>


<div id="outline-container-org512e7eb" class="outline-2">
<h2 id="org512e7eb"><a href="https://time.geekbang.org/column/article/12648">132 | ICML 2018论文精读：聊一聊机器学习算法的“公平性”问题</a></h2>
<div class="outline-text-2" id="text-org512e7eb">
<p>
今天，我们来分享ICML 2018的另一篇最佳论文。这篇文章探讨的主题是机器学习的“公平性”问题。
</p>
</div>
</div>


<div id="outline-container-orge8ab2c9" class="outline-2">
<h2 id="orge8ab2c9"><a href="https://time.geekbang.org/column/article/12834">133 | ICML 2018论文精读：优化目标函数的时候，有可能放大了“不公平”？</a></h2>
<div class="outline-text-2" id="text-orge8ab2c9">
<p>
今天我们要分享的是ICML 2018的一篇最佳论文提名，这篇文章从优化目标函数的角度，来讨论机器学习算法的公平性&#x2026;
</p>
</div>
</div>


<div id="outline-container-org7743ffe" class="outline-2">
<h2 id="org7743ffe"><a href="https://time.geekbang.org/column/article/13014">134 | ACL 2018论文精读：问答系统场景下，如何提出好问题？</a></h2>
<div class="outline-text-2" id="text-org7743ffe">
<p>
ACL 2018，计算语言学协会年会，是自然语言处理和计算语言学领域的顶级会议。今天我和你分享一篇今年的最佳论&#x2026;
</p>
</div>
</div>


<div id="outline-container-org0521ff5" class="outline-2">
<h2 id="org0521ff5"><a href="https://time.geekbang.org/column/article/13193">135 | ACL 2018论文精读：什么是对话中的前提触发？如何检测？</a></h2>
<div class="outline-text-2" id="text-org0521ff5">
<p>
今天，我来和你分享ACL 2018的第二篇最佳论文。这篇论文的背景要从语用学说起。
</p>
</div>
</div>


<div id="outline-container-org10f0405" class="outline-2">
<h2 id="org10f0405"><a href="https://time.geekbang.org/column/article/13276">136 | ACL 2018论文精读：什么是“端到端”的语义哈希？</a></h2>
<div class="outline-text-2" id="text-org10f0405">
<p>
今天，给你分享一篇ACL 2018的最佳论文提名，聊一聊语义哈希的生成过程。
</p>
</div>
</div>


<div id="outline-container-org7ab8fa2" class="outline-2">
<h2 id="org7ab8fa2"><a href="https://time.geekbang.org/column/article/13471">137 | 如何做好人工智能项目的管理？</a></h2>
<div class="outline-text-2" id="text-org7ab8fa2">
<p>
今天，我们回到数据科学团队养成这个主题，首先跟你聊聊人工智能项目管理这个话题。
</p>
</div>
</div>


<div id="outline-container-org963af09" class="outline-2">
<h2 id="org963af09"><a href="https://time.geekbang.org/column/article/13665">138 | 数据科学团队必备的工程流程三部曲</a></h2>
<div class="outline-text-2" id="text-org963af09">
<p>
一个人工智能项目的发展和成功需要工程流程，那到底什么是工程流程？又有哪些主要的方面？
</p>
</div>
</div>


<div id="outline-container-orge9b80ea" class="outline-2">
<h2 id="orge9b80ea"><a href="https://time.geekbang.org/column/article/13816">139 | 数据科学团队怎么选择产品和项目？</a></h2>
<div class="outline-text-2" id="text-orge9b80ea">
<p>
今天，我们来继续讨论数据科学团队发展这个话题，来看另外两个关键问题：如何选择合作产品以及如何选择项目。
</p>
</div>
</div>


<div id="outline-container-orgaa9eb04" class="outline-2">
<h2 id="orgaa9eb04"><a href="https://time.geekbang.org/column/article/14002">140 | 什么是计算机视觉？</a></h2>
<div class="outline-text-2" id="text-orgaa9eb04">
<p>
从今天开始，我们来分享专栏里人工智能核心技术模块的最后一部分内容：计算机视觉技术。第一篇，我来和你分享计&#x2026;
</p>
</div>
</div>


<div id="outline-container-org7a11967" class="outline-2">
<h2 id="org7a11967"><a href="https://time.geekbang.org/column/article/14193">141 | 掌握计算机视觉任务的基础模型和操作</a></h2>
<div class="outline-text-2" id="text-org7a11967">
<p>
今天，我们来聊一聊计算机视觉的一些最基础的操作和任务，包括像素表达、过滤器和边界探测。
</p>
</div>
</div>


<div id="outline-container-org6be5548" class="outline-2">
<h2 id="org6be5548"><a href="https://time.geekbang.org/column/article/14349">142 | 计算机视觉中的特征提取难在哪里？</a></h2>
<div class="outline-text-2" id="text-org6be5548">
<p>
今天，我们来看计算机视觉基础问题中的另一个核心任务，那就是特征提取。
</p>
</div>
</div>


<div id="outline-container-org8b7d378" class="outline-2">
<h2 id="org8b7d378"><a href="https://time.geekbang.org/column/article/14574">143 | 基于深度学习的计算机视觉技术（一）：深度神经网络入门</a></h2>
<div class="outline-text-2" id="text-org8b7d378">
<p>
从今天开始，我们将介绍一系列以深度学习为背景的计算机视觉技术。
</p>
</div>
</div>


<div id="outline-container-orgc172a58" class="outline-2">
<h2 id="orgc172a58"><a href="https://time.geekbang.org/column/article/14853">144 | 基于深度学习的计算机视觉技术（二）：基本的深度学习模型</a></h2>
<div class="outline-text-2" id="text-orgc172a58">
<p>
今天，我们来聊一聊应用到图像上的一些最基本的深度学习模型。
</p>
</div>
</div>


<div id="outline-container-orgcb0d8cc" class="outline-2">
<h2 id="orgcb0d8cc"><a href="https://time.geekbang.org/column/article/16938">145 | 基于深度学习的计算机视觉技术（三）：深度学习模型的优化</a></h2>
<div class="outline-text-2" id="text-orgcb0d8cc">
<p>
今天，我们从优化的角度来讨论，如何对深度学习模型进行训练。
</p>
</div>
</div>


<div id="outline-container-orgb8525eb" class="outline-2">
<h2 id="orgb8525eb"><a href="https://time.geekbang.org/column/article/17874">146 | 计算机视觉领域的深度学习模型（一）：AlexNet</a></h2>
<div class="outline-text-2" id="text-orgb8525eb">
<p>
从今天开始，我们进入一个新的模块，我会结合几篇经典的论文，给你介绍几个专门为计算机视觉而提出来的深度学习&#x2026;
</p>
</div>
</div>


<div id="outline-container-orge4622b9" class="outline-2">
<h2 id="orge4622b9"><a href="https://time.geekbang.org/column/article/18126">147 | 计算机视觉领域的深度学习模型（二）：VGG &amp; GoogleNet</a></h2>
<div class="outline-text-2" id="text-orge4622b9">
<p>
今天我们就来看看针对AlexNet模型的两个重要改进，分别是VGG和GoogleNet。
</p>
</div>
</div>


<div id="outline-container-orgae86f8d" class="outline-2">
<h2 id="orgae86f8d"><a href="https://time.geekbang.org/column/article/22892">148 | 计算机视觉领域的深度学习模型（三）：ResNet</a></h2>
<div class="outline-text-2" id="text-orgae86f8d">
<p>
今天要跟你分享的这篇论文，获得了CVPR 2016的最佳论文，提出了“残差网络”这个概念。
</p>
</div>
</div>


<div id="outline-container-orgbad9635" class="outline-2">
<h2 id="orgbad9635"><a href="https://time.geekbang.org/column/article/39727">149 | 计算机视觉高级话题（一）：图像物体识别和分割</a></h2>
<div class="outline-text-2" id="text-orgbad9635">
<p>
从今天开始，我们讨论几个相对比较高级的计算机视觉话题。这些话题都不是简单的分类或者回归任务，而是需要在一&#x2026;
</p>
</div>
</div>


<div id="outline-container-orge5cedf1" class="outline-2">
<h2 id="orge5cedf1"><a href="https://time.geekbang.org/column/article/39929">150 | 计算机视觉高级话题（二）：视觉问答</a></h2>
<div class="outline-text-2" id="text-orge5cedf1">
<p>
今天，我们继续分享计算机视觉领域的高级话题，聊一聊“视觉问答”这个话题。
</p>
</div>
</div>


<div id="outline-container-org88c5cb5" class="outline-2">
<h2 id="org88c5cb5"><a href="https://time.geekbang.org/column/article/40063">151 | 计算机视觉高级话题（三）：产生式模型</a></h2>
<div class="outline-text-2" id="text-org88c5cb5">
<p>
今天我们来聊一聊“产生式模型”，针对数据建模的产生式模型的基本思路是怎样的呢？
</p>
</div>
</div>


<div id="outline-container-orgd7391dd" class="outline-2">
<h2 id="orgd7391dd"><a href="https://time.geekbang.org/column/article/40221">152 | 在人工智能领域，如何快速找到学习的切入点？</a></h2>
<div class="outline-text-2" id="text-orgd7391dd">
<p>
今天我就来分享一下如何快速入门人工智能领域，帮你找到一些学习的捷径。
</p>
</div>
</div>


<div id="outline-container-org32dc77f" class="outline-2">
<h2 id="org32dc77f"><a href="https://time.geekbang.org/column/article/40403">153 | 人工智能技术选择，该从哪里获得灵感？</a></h2>
<div class="outline-text-2" id="text-org32dc77f">
<p>
人工智能领域的新论文和技术分享层出不穷，在我们自己的工程实践中，该如何去选择呢？
</p>
</div>
</div>


<div id="outline-container-org06f18ee" class="outline-2">
<h2 id="org06f18ee"><a href="https://time.geekbang.org/column/article/40456">154 | 近在咫尺，走进人工智能研究</a></h2>
<div class="outline-text-2" id="text-org06f18ee">
<p>
你觉得人工智能研究离自己比较远吗？实际上，我们有必要了解做研究的一些基本原理，而且这些思路能够应用到我们&#x2026;
</p>
</div>
</div>


<div id="outline-container-orgf88f156" class="outline-2">
<h2 id="orgf88f156"><a href="https://time.geekbang.org/column/article/40617">155 | 微软研究院：工业界研究机构的楷模</a></h2>
<div class="outline-text-2" id="text-orgf88f156">
<p>
微软研究院堪称工业界研究机构的模板，今天我们就一起来梳理一下微软研究院这一具有传奇色彩研究机构的传奇故事&#x2026;
</p>
</div>
</div>
