src/geekbang-ai-internal-reference.org
** [[https://time.geekbang.org/column/article/40765][156 | 聊一聊谷歌特立独行的混合型研究]]

今天我们来看另外一种“混合型”的工业界研究机构模式，聊一聊谷歌研究院。


** [[https://time.geekbang.org/column/article/41115][复盘 4 | 广告系统核心技术模块]]

今天我准备了 18 张知识卡，和你一起来对广告系统核心技术模块的内容做一个复盘。


** [[https://time.geekbang.org/column/article/41179][复盘 5 | 计算机视觉核心技术模块]]

今天我准备了12张知识卡，一起来复盘“计算机视觉核心技术”模块。


** [[https://time.geekbang.org/column/article/41257][复盘 6 | 数据科学家与数据科学团队是怎么养成的？]]

今天，我准备了24张知识卡，和你一起复盘数据科学家和数据科学团队的养成这两个模块。


** [[https://time.geekbang.org/column/article/41364][复盘 7 | 一起来读人工智能国际顶级会议论文]]

今天我准备了 30 张知识卡，和你一起来复盘“人工智能国际顶级会议”模块。


** [[https://time.geekbang.org/column/article/41595][结束语 | 雄关漫道真如铁，而今迈步从头越]]

在整整一年的时间里，我们一起学习了156篇文章，阅读了40多万字，收听了20多个小时的音频。结束，是新的开始。
