html/geekbang-ai-internal-reference.html


<div id="outline-container-org4ba31ae" class="outline-2">
<h2 id="org4ba31ae"><a href="https://time.geekbang.org/column/article/40765">156 | 聊一聊谷歌特立独行的混合型研究</a></h2>
<div class="outline-text-2" id="text-org4ba31ae">
<p>
今天我们来看另外一种“混合型”的工业界研究机构模式，聊一聊谷歌研究院。
</p>
</div>
</div>


<div id="outline-container-org7c35c60" class="outline-2">
<h2 id="org7c35c60"><a href="https://time.geekbang.org/column/article/41115">复盘 4 | 广告系统核心技术模块</a></h2>
<div class="outline-text-2" id="text-org7c35c60">
<p>
今天我准备了 18 张知识卡，和你一起来对广告系统核心技术模块的内容做一个复盘。
</p>
</div>
</div>


<div id="outline-container-org303df25" class="outline-2">
<h2 id="org303df25"><a href="https://time.geekbang.org/column/article/41179">复盘 5 | 计算机视觉核心技术模块</a></h2>
<div class="outline-text-2" id="text-org303df25">
<p>
今天我准备了12张知识卡，一起来复盘“计算机视觉核心技术”模块。
</p>
</div>
</div>


<div id="outline-container-org2f81b1d" class="outline-2">
<h2 id="org2f81b1d"><a href="https://time.geekbang.org/column/article/41257">复盘 6 | 数据科学家与数据科学团队是怎么养成的？</a></h2>
<div class="outline-text-2" id="text-org2f81b1d">
<p>
今天，我准备了24张知识卡，和你一起复盘数据科学家和数据科学团队的养成这两个模块。
</p>
</div>
</div>


<div id="outline-container-orgddbadbe" class="outline-2">
<h2 id="orgddbadbe"><a href="https://time.geekbang.org/column/article/41364">复盘 7 | 一起来读人工智能国际顶级会议论文</a></h2>
<div class="outline-text-2" id="text-orgddbadbe">
<p>
今天我准备了 30 张知识卡，和你一起来复盘“人工智能国际顶级会议”模块。
</p>
</div>
</div>


<div id="outline-container-org033bfd6" class="outline-2">
<h2 id="org033bfd6"><a href="https://time.geekbang.org/column/article/41595">结束语 | 雄关漫道真如铁，而今迈步从头越</a></h2>
<div class="outline-text-2" id="text-org033bfd6">
<p>
在整整一年的时间里，我们一起学习了156篇文章，阅读了40多万字，收听了20多个小时的音频。结束，是新的开始。
</p>
</div>
</div>
</div>
</body>
</html>
